app/controllers/feed_items_controller.rb

  def show
    @feed_item = FeedItem.find(params[:id])
---
SELECT `feed_items`.* FROM `feed_items` WHERE `feed_items`.`id` = 1 ORDER BY feed_items.created_at DESC LIMIT 1

  def create
    @feed_item = FeedItem.create!(params[:feed_item])
    @feed_item.user = current_user
    @feed_item.place = Place.find(params[:place][:id])
    @feed_item.save!
---
INSERT INTO `feed_items` (`created_at`, `is_active`, `photo_content_type`, `photo_file_name`, `photo_file_size`, `photo_updated_at`, `place_id`, `rating`, `review`, `updated_at`, `user_id`) VALUES ('2013-02-03 10:46:31', 1, NULL, NULL, NULL, NULL, NULL, 4, 'Sfd dsaf sdf sdf sd', '2013-02-03 10:46:31', NULL)
SELECT `places`.* FROM `places` WHERE `places`.`id` = 28 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
UPDATE `feed_items` SET `photo_updated_at` = '2013-02-03 12:26:20', `updated_at` = '2013-02-03 12:26:20' WHERE `feed_items`.`id` = 15
UPDATE `users` SET `last_sign_in_at` = '2013-01-30 18:17:46', `current_sign_in_at` = '2013-01-30 18:18:48', `sign_in_count` = 15, `updated_at` = '2013-01-30 18:18:48' WHERE `users`.`id` = 1