app/controllers/token_authentications_controller.rb

  def create
    if params[:platform] == "facebook"
      facebook_user = FbGraph::User.fetch(params[:user_id], :access_token => params[:access_token])
      puts facebook_user.to_yaml
      puts facebook_user.location.name
      @user = User.find_by_fbuid(params[:user_id])
      if @user
        @user.update_user_from_fb_graph(facebook_user)
      else
         @user = User.create_user_from_fb_graph(facebook_user)
---
SELECT `users`.* FROM `users` WHERE `users`.`fbuid` = 7301100 LIMIT 1
UPDATE `users` SET `fb_token` = 'BAAF6sVmj14sBAPdP4QpqXqAM8xIVDOzJkXUjhrqPj7s2W9K7kd7PhsCQyy68xSrVfVJrZA7KMcYTcDgiIDGsdDH86njo4nMbz8K8ZADuvPGv9yRlif6ZAZCE6s15D2R2mVqmIJioEwZDZD', `photo_file_name` = 'picture', `photo_content_type` = 'image/jpeg', `photo_file_size` = 4022, `photo_updated_at` = '2013-01-30 10:58:40', `authentication_token` = 'YsA9pBbwvRXcQHWnGYfc', `updated_at` = '2013-01-30 10:58:42' WHERE `users`.`id` = 1
INSERT INTO `users` (`authentication_token`, `birthday`, `created_at`, `current_sign_in_at`, `current_sign_in_ip`, `email`, `encrypted_password`, `fb_token`, `fbuid`, `first_name`, `is_active`, `last_name`, `last_sign_in_at`, `last_sign_in_ip`, `location`, `name`, `photo_content_type`, `photo_file_name`, `photo_file_size`, `photo_updated_at`, `provider`, `remember_created_at`, `reset_password_sent_at`, `reset_password_token`, `sign_in_count`, `updated_at`, `vk_token`) VALUES (NULL, NULL, '2013-01-30 07:46:41', NULL, NULL, 'rromanchuk@gmail.com', '$2a$10$kOaJ4W/hjpOJksevOOzlk..X1KRnREwGW48t/4.0dOgFlLB4bPEQW', NULL, 7301100, NULL, NULL, NULL, NULL, NULL, NULL, 'Ryan Romanchuk', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 0, '2013-01-30 07:46:41', NULL)