app/controllers/users/omniauth_callbacks_controller.rb

  def facebook
    # You need to implement the method below in your model
    auth = request.env["omniauth.auth"]
    facebook_user =  FbGraph::User.fetch(auth.uid, :access_token => auth.credentials.token)
    @user = User.find_or_create_for_facebook_oauth(facebook_user, current_user)
---
INSERT INTO `users` (`authentication_token`, `birthday`, `created_at`, `current_sign_in_at`, `current_sign_in_ip`, `email`, `encrypted_password`, `fb_token`, `fbuid`, `first_name`, `is_active`, `last_name`, `last_sign_in_at`, `last_sign_in_ip`, `location`, `name`, `photo_content_type`, `photo_file_name`, `photo_file_size`, `photo_updated_at`, `provider`, `remember_created_at`, `reset_password_sent_at`, `reset_password_token`, `sign_in_count`, `updated_at`, `vk_token`) VALUES (NULL, NULL, '2013-01-30 09:03:24', NULL, NULL, 'rromanchuk@gmail.com', '$2a$10$Qrl3ycb4ZByFDk/h/qpA4eCQGP1M24dIBeIRVBkaqa50SPX5rvqay', NULL, 7301100, NULL, NULL, NULL, NULL, NULL, NULL, 'Ryan Romanchuk', NULL, NULL, NULL, NULL, 'facebook', NULL, NULL, NULL, 0, '2013-01-30 09:03:24', NULL)